load-testing/cart/v2/scripts/endpoint/get-cart-once-time.yml
config:
  target: "http://localhost:8080/api/v2/cart"
  phases:
    - duration: 60         # duración total de la prueba: 2 minutos
      arrivalRate: 1        # 1 usuario por segundo
      maxVusers: 20         # máximo 20 usuarios simultáneos

http:
  timeout: 20000          # 20 segundos de timeout
  maxSockets: 1           # cada VU usa solo 1 conexión → simula cliente secuencial
  discardResponseBodies: false

scenarios:
  - name: "[GET] Get cart by custemer, note, this cart must be record of way manual"
    flow:         
      - think: 5                      
      - get:
          url: "/customer/168a1448-bd14-4ee2-98ed-ffd2b619830c"